balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128MC506A.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnn-n-nn" edc:cname="C1RXF13SID" edc:desc="" edc:impl="0xffeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxx-x-xx" edc:name="C1RXF13SID" edc:nzwidth="0x10" edc:por="xxxxxxxxxxx-x-xx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3" edc:name="EID" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="11"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1RXF13EID" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="C1RXF13EID" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xffff" edc:name="EID" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnn-n-nn" edc:cname="C1RXF14SID" edc:desc="" edc:impl="0xffeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxx-x-xx" edc:name="C1RXF14SID" edc:nzwidth="0x10" edc:por="xxxxxxxxxxx-x-xx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3" edc:name="EID" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="11"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1RXF14EID" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="C1RXF14EID" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xffff" edc:name="EID" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnn-n-nn" edc:cname="C1RXF15SID" edc:desc="" edc:impl="0xffeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxx-x-xx" edc:name="C1RXF15SID" edc:nzwidth="0x10" edc:por="xxxxxxxxxxx-x-xx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3" edc:name="EID" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="11"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1RXF15EID" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="C1RXF15EID" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xffff" edc:name="EID" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="160"/>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x500 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2BUFPNT1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2BUFPNT1" edc:nmmrid="0x54" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="F0BP" edc:desc="" edc:mask="0xf" edc:name="F0BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F1BP" edc:desc="" edc:mask="0xf" edc:name="F1BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F2BP" edc:desc="" edc:mask="0xf" edc:name="F2BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F3BP" edc:desc="" edc:mask="0xf" edc:name="F3BP" edc:nzwidth="0x4"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="cccccccccccccccc" edc:cname="C2RXFUL1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2RXFUL1" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="RXFUL0" edc:desc="" edc:mask="0x1" edc:name="RXFUL0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL1" edc:desc="" edc:mask="0x1" edc:name="RXFUL1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL2" edc:desc="" edc:mask="0x1" edc:name="RXFUL2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL3" edc:desc="" edc:mask="0x1" edc:name="RXFUL3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL4" edc:desc="" edc:mask="0x1" edc:name="RXFUL4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL5" edc:desc="" edc:mask="0x1" edc:name="RXFUL5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL6" edc:desc="" edc:mask="0x1" edc:name="RXFUL6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL7" edc:desc="" edc:mask="0x1" edc:name="RXFUL7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL8" edc:desc="" edc:mask="0x1" edc:name="RXFUL8" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL9" edc:desc="" edc:mask="0x1" edc:name="RXFUL9" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL10" edc:desc="" edc:mask="0x1" edc:name="RXFUL10" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL11" edc:desc="" edc:mask="0x1" edc:name="RXFUL11" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL12" edc:desc="" edc:mask="0x1" edc:name="RXFUL12" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL13" edc:desc="" edc:mask="0x1" edc:name="RXFUL13" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL14" edc:desc="" edc:mask="0x1" edc:name="RXFUL14" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL15" edc:desc="" edc:mask="0x1" edc:name="RXFUL15" edc:nzwidth="0x1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
              <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x500 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2BUFPNT2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2BUFPNT2" edc:nmmrid="0x56" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="F4BP" edc:desc="" edc:mask="0xf" edc:name="F4BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F5BP" edc:desc="" edc:mask="0xf" edc:name="F5BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F6BP" edc:desc="" edc:mask="0xf" edc:name="F6BP" edc:nzwidth="0x4"/>
                  <edc:SFRFieldDef edc:cname="F7BP" edc:desc="" edc:mask="0xf" edc:name="F7BP" edc:nzwidth="0x4"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="cccccccccccccccc" edc:cname="C2RXFUL2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2RXFUL2" edc:nzwidth="0x10" edc:por="0000000000000000">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="RXFUL16" edc:desc="" edc:mask="0x1" edc:name="RXFUL16" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL17" edc:desc="" edc:mask="0x1" edc:name="RXFUL17" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL18" edc:desc="" edc:mask="0x1" edc:name="RXFUL18" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL19" edc:desc="" edc:mask="0x1" edc:name="RXFUL19" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL20" edc:desc="" edc:mask="0x1" edc:name="RXFUL20" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL21" edc:desc="" edc:mask="0x1" edc:name="RXFUL21" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL22" edc:desc="" edc:mask="0x1" edc:name="RXFUL22" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL23" edc:desc="" edc:mask="0x1" edc:name="RXFUL23" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL24" edc:desc="" edc:mask="0x1" edc:name="RXFUL24" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL25" edc:desc="" edc:mask="0x1" edc:name="RXFUL25" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL26" edc:desc="" edc:mask="0x1" edc:name="RXFUL26" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL27" edc:desc="" edc:mask="0x1" edc:name="RXFUL27" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL28" edc:desc="" edc:mask="0x1" edc:name="RXFUL28" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL29" edc:desc="" edc:mask="0x1" edc:name="RXFUL29" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL30" edc:desc="" edc:mask="0x1" edc:name="RXFUL30" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="RXFUL31" edc:desc="" edc:mask="0x1" edc:name="RXFUL31" edc:nzwidth="0x1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
              <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
