balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128MC506A.PIC
        <edc:AdjustPoint edc:offset="8"/>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x500 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnn-n-nn" edc:cname="C2RXF0SID" edc:desc="" edc:dma="r" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxx0x0xx" edc:name="C2RXF0SID" edc:nmmrid="0x68" edc:nzwidth="0x10" edc:por="xxxxxxxxxxx0x0xx">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
                  <edc:AdjustPoint edc:offset="1"/>
                  <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
                  <edc:AdjustPoint edc:offset="1"/>
                  <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnn-" edc:cname="C2RXD" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuu-" edc:name="C2RXD" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxx-">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:AdjustPoint edc:offset="1"/>
                  <edc:SFRFieldDef edc:cname="C2RXD" edc:desc="" edc:mask="0x7fff" edc:name="C2RXD" edc:nzwidth="15"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:MuxedSFRDef edc:nzwidth="0x10">
          <edc:SelectSFR edc:when="($0x500 &amp; 0x1) == 0x1">
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2RXF0EID" edc:desc="" edc:dma="w" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="C2RXF0EID" edc:nmmrid="0x6a" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
                  <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef edc:access="nnnnnnnnnnnnnnn-" edc:cname="C2TXD" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuu-" edc:name="C2TXD" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxx-">
              <edc:AliasList/>
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0">
                  <edc:AdjustPoint edc:offset="1"/>
                  <edc:SFRFieldDef edc:cname="C2TXD" edc:desc="" edc:mask="0x7fff" edc:name="C2TXD" edc:nzwidth="15"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:AdjustPoint edc:offset="398"/>
        <edc:SFRDef edc:access="----nnnnnnnnnnnn" edc:cname="ODCD" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----000000000000" edc:name="ODCD" edc:nzwidth="0x10" edc:por="----000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCD0" edc:desc="" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD1" edc:desc="" edc:mask="0x1" edc:name="ODCD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD2" edc:desc="" edc:mask="0x1" edc:name="ODCD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD3" edc:desc="" edc:mask="0x1" edc:name="ODCD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD4" edc:desc="" edc:mask="0x1" edc:name="ODCD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD5" edc:desc="" edc:mask="0x1" edc:name="ODCD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD6" edc:desc="" edc:mask="0x1" edc:name="ODCD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD7" edc:desc="" edc:mask="0x1" edc:name="ODCD7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD8" edc:desc="" edc:mask="0x1" edc:name="ODCD8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD9" edc:desc="" edc:mask="0x1" edc:name="ODCD9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD10" edc:desc="" edc:mask="0x1" edc:name="ODCD10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD11" edc:desc="" edc:mask="0x1" edc:name="ODCD11" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ODCD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="10"/>
        <edc:SFRDef edc:access="---------nnnnnnn" edc:cname="ODCF" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0000000" edc:name="ODCF" edc:nzwidth="0x10" edc:por="---------0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCF0" edc:desc="" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF1" edc:desc="" edc:mask="0x1" edc:name="ODCF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF2" edc:desc="" edc:mask="0x1" edc:name="ODCF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF3" edc:desc="" edc:mask="0x1" edc:name="ODCF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF4" edc:desc="" edc:mask="0x1" edc:name="ODCF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF5" edc:desc="" edc:mask="0x1" edc:name="ODCF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF6" edc:desc="" edc:mask="0x1" edc:name="ODCF6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ODCF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="------nnnn--nn--" edc:cname="ODCG" edc:desc="" edc:impl="0x3cc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000--00--" edc:name="ODCG" edc:nzwidth="0x10" edc:por="------0000--00--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ODCG2" edc:desc="" edc:mask="0x1" edc:name="ODCG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCG3" edc:desc="" edc:mask="0x1" edc:name="ODCG3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ODCG6" edc:desc="" edc:mask="0x1" edc:name="ODCG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCG7" edc:desc="" edc:mask="0x1" edc:name="ODCG7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCG8" edc:desc="" edc:mask="0x1" edc:name="ODCG8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCG9" edc:desc="" edc:mask="0x1" edc:name="ODCG9" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCG" edc:desc="" edc:mask="0xffff" edc:name="ODCG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
